struct _m2c_stack_func_800B47C4 {
    /* 0x000 */ char pad0[0x20];
    /* 0x020 */ s32 sp20;                           /* inferred */
    /* 0x024 */ s16 sp24;                           /* inferred */
    /* 0x026 */ char pad26[0x3A];                   /* maybe part of sp24[0x1E]? */
    /* 0x060 */ u8 sp60;                            /* inferred */
    /* 0x061 */ u8 sp61;                            /* inferred */
    /* 0x062 */ u8 sp62;                            /* inferred */
    /* 0x063 */ u8 sp63;                            /* inferred */
    /* 0x064 */ char pad64[4];                      /* maybe part of sp63[5]? */
    /* 0x068 */ s8 sp68;                            /* inferred */
    /* 0x069 */ s8 sp69;                            /* inferred */
    /* 0x06A */ s8 sp6A;                            /* inferred */
    /* 0x06B */ u8 sp6B;                            /* inferred */
    /* 0x06C */ char pad6C[4];                      /* maybe part of sp6B[5]? */
    /* 0x070 */ ? sp70;                             /* inferred */
    /* 0x070 */ char pad70[1];
    /* 0x071 */ ? sp71;                             /* inferred */
    /* 0x071 */ char pad71[0xE];
    /* 0x07F */ u8 sp7F;                            /* inferred */
    /* 0x080 */ u8 sp80;                            /* inferred */
    /* 0x081 */ u8 sp81;                            /* inferred */
    /* 0x082 */ u8 sp82;                            /* inferred */
    /* 0x083 */ char pad83[0xC];                    /* maybe part of sp82[0xD]? */
    /* 0x08F */ u8 sp8F;                            /* inferred */
    /* 0x090 */ u8 sp90;                            /* inferred */
    /* 0x091 */ char pad91[0xE];                    /* maybe part of sp90[0xF]? */
    /* 0x09F */ u8 sp9F;                            /* inferred */
    /* 0x0A0 */ char padA0[7];                      /* maybe part of sp9F[8]? */
    /* 0x0A7 */ u8 spA7;                            /* inferred */
    /* 0x0A8 */ char padA8[7];                      /* maybe part of spA7[8]? */
    /* 0x0AF */ u8 spAF;                            /* inferred */
    /* 0x0B0 */ u8 spB0;                            /* inferred */
    /* 0x0B1 */ u8 spB1;                            /* inferred */
    /* 0x0B2 */ u8 spB2;                            /* inferred */
    /* 0x0B3 */ char padB3[0xC];                    /* maybe part of spB2[0xD]? */
    /* 0x0BF */ u8 spBF;                            /* inferred */
    /* 0x0C0 */ u8 spC0;                            /* inferred */
    /* 0x0C1 */ char padC1[0xE];                    /* maybe part of spC0[0xF]? */
    /* 0x0CF */ u8 spCF;                            /* inferred */
    /* 0x0D0 */ char padD0[7];                      /* maybe part of spCF[8]? */
    /* 0x0D7 */ u8 spD7;                            /* inferred */
    /* 0x0D8 */ char padD8[7];                      /* maybe part of spD7[8]? */
    /* 0x0DF */ u8 spDF;                            /* inferred */
    /* 0x0E0 */ u8 spE0;                            /* inferred */
    /* 0x0E1 */ u8 spE1;                            /* inferred */
    /* 0x0E2 */ u8 spE2;                            /* inferred */
    /* 0x0E3 */ char padE3[0xC];                    /* maybe part of spE2[0xD]? */
    /* 0x0EF */ u8 spEF;                            /* inferred */
    /* 0x0F0 */ char padF0[7];                      /* maybe part of spEF[8]? */
    /* 0x0F7 */ u8 spF7;                            /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ f32 sp110;                          /* inferred */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ f32 sp11C;                          /* inferred */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ void *sp128;                        /* inferred */
    /* 0x12C */ u8 *sp12C;                          /* inferred */
    /* 0x130 */ s32 sp130;                          /* inferred */
    /* 0x134 */ s32 sp134;                          /* inferred */
    /* 0x138 */ void *sp138;                        /* inferred */
    /* 0x13C */ char pad13C[0x5C];
};                                                  /* size = 0x198 */

? func_80002FF4();                                  /* extern */
s32 func_80003430(s32 *);                           /* extern */
? func_8000A6CC();                                  /* extern */
? func_8000A86C();                                  /* extern */
? func_8000B654();                                  /* extern */
? func_8000B6F4();                                  /* extern */
? func_8000BF60();                                  /* extern */
? func_8000C07C();                                  /* extern */
? func_80016C44(? *);                               /* extern */
? func_8001CA90(s32, ?, ?, ?);                      /* extern */
? func_8001CB64(s32, ?, ?, ?);                      /* extern */
f32 func_8001E20C(f32, f32);                        /* extern */
? func_80055880(? *);                               /* extern */
