struct _m2c_stack_func_800C298C {
    /* 0x000 */ char pad0[0x18];
    /* 0x018 */ u8 sp18;                            /* inferred */
    /* 0x019 */ char pad19[1];
    /* 0x01A */ u8 sp1A;                            /* inferred */
    /* 0x01B */ char pad1B[0x4D];                   /* maybe part of sp1A[0x4E]? */
    /* 0x068 */ f32 sp68;                           /* inferred */
    /* 0x06C */ f32 sp6C;                           /* inferred */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ f32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ char pad80[0x18];                   /* maybe part of sp7C[7]? */
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ f32 sp9C;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ char padA4[4];
    /* 0x0A8 */ s32 spA8;                           /* inferred */
    /* 0x0AC */ s32 spAC;                           /* inferred */
    /* 0x0B0 */ s32 spB0;                           /* inferred */
    /* 0x0B4 */ s32 spB4;                           /* inferred */
    /* 0x0B8 */ s32 spB8;                           /* inferred */
    /* 0x0BC */ s32 spBC;                           /* inferred */
    /* 0x0C0 */ s32 spC0;                           /* inferred */
    /* 0x0C4 */ char padC4[0x5C];
};                                                  /* size = 0x120 */

f32 cosf(f32, u8);                                  /* extern */
? func_8001CA90(f32 *, f32, f32, f32);              /* extern */
? func_8001CB64(s32, f32, f32, f32);                /* extern */
? func_8001CB9C(s32, f32);                          /* extern */
? func_8001CCCC(s32, f32);                          /* extern */
? func_8001CF58(void *);                            /* extern */
? func_800538B0(void *, s32, f32 *);                /* extern */
? func_80059B50(f32 *, f32 *, f32);                 /* extern */
? func_80059D18(f32 *, s32);                        /* extern */
s32 func_8006B3D0();                                /* extern */
f32 sinf(f32);                                      /* extern */
? sprintf(u8 *, ? *, s8 *, s8 *);                   /* extern */
extern ? .L800B4E8C;
extern ? .L800B51E4;
extern ? .L800B5208;
extern ? .L800B521C;
extern ? .L800B533C;
